app/Models/BookModel.php

    public function search(?string $keyword = null, ?int $categoryId = null, int $perPage = 10): array
    {
        $this->select('books.*, categories.nama AS nama_kategori')
             ->join('categories', 'categories.id = books.category_id', 'left');

        if ($keyword !== null && $keyword !== '') {
            // groupStart()/groupEnd() membungkus rangkaian OR di dalam
            // tanda kurung agar tidak "bocor" ke filter kategori.
            $this->groupStart()
                 ->like('books.judul', $keyword)
                 ->orLike('books.penulis', $keyword)
                 ->orLike('books.penerbit', $keyword)
                 ->orLike('books.kode_buku', $keyword)
                 ->orLike('books.isbn', $keyword)
                 ->groupEnd();
        }

        if ($categoryId !== null && $categoryId > 0) {
            $this->where('books.category_id', $categoryId);
        }

        // 'books' = nama grup pager, dipakai lagi saat merender link
        return $this->orderBy('books.id', 'DESC')->paginate($perPage, 'books');
---
SELECT COUNT(*) AS `numrows`
FROM `books`
LEFT JOIN `categories` ON `categories`.`id` = `books`.`category_id`
WHERE `books`.`deleted_at` IS NULL
SELECT `books`.*, `categories`.`nama` AS `nama_kategori`
FROM `books`
LEFT JOIN `categories` ON `categories`.`id` = `books`.`category_id`
WHERE `books`.`deleted_at` IS NULL
ORDER BY `books`.`id` DESC
 LIMIT 10

    public function ringkasan(): array
    {
        $baris = $this->db->table('books')
            ->select('COUNT(id) AS judul, COALESCE(SUM(stok),0) AS eksemplar,
                      COALESCE(SUM(stok_tersedia),0) AS tersedia')
            ->where('deleted_at', null)
            ->get()
            ->getRowArray();
---
SELECT COUNT(id) AS judul, COALESCE(SUM(stok), 0) AS eksemplar, COALESCE(SUM(stok_tersedia), 0) AS tersedia
FROM `books`
WHERE `deleted_at` IS NULL