app/Models/CategoryModel.php

    public function search(?string $keyword = null, int $perPage = 10): array
    {
        if ($keyword !== null && $keyword !== '') {
            // groupStart()/groupEnd() membungkus rangkaian OR di dalam
            // tanda kurung agar tidak bercampur dengan kondisi lain
            // (mis. filter soft delete yang ditambahkan Model).
            $this->groupStart()
                 ->like('nama', $keyword)
                 ->orLike('slug', $keyword)
                 ->orLike('deskripsi', $keyword)
                 ->groupEnd();
        }

        // 'categories' = nama grup pager, dipakai lagi saat merender link
        return $this->orderBy('nama', 'ASC')->paginate($perPage, 'categories');
---
SELECT *
FROM `categories`
WHERE `categories`.`deleted_at` IS NULL
ORDER BY `nama` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `categories`
WHERE `categories`.`deleted_at` IS NULL

    public function hitungBuku(array $categoryIds): array
    {
        if ($categoryIds === []) {
            return [];
        }

        $baris = $this->db->table('books')
            ->select('category_id, COUNT(id) AS jumlah')
            ->whereIn('category_id', $categoryIds)
            ->where('deleted_at', null)   // buku yang sudah dihapus tidak dihitung
            ->groupBy('category_id')
            ->get()
            ->getResultArray();
---
SELECT `category_id`, COUNT(id) AS jumlah
FROM `books`
WHERE `category_id` IN ('7','8','6','1','5','2','4','3')
AND `deleted_at` IS NULL
GROUP BY `category_id`

    public function ringkasan(): array
    {
        $totalKategori = $this->db->table('categories')
            ->where('deleted_at', null)
            ->countAllResults();

        /*
         * Berapa kategori yang punya minimal satu buku aktif.
         * Dipakai COUNT(DISTINCT ...) - BUKAN countAllResults() + groupBy -
         * karena countAllResults() pada query ber-GROUP BY mengembalikan
         * jumlah baris grup pertama, bukan banyaknya grup.
         */
        $baris = $this->db->table('books')
            ->select('COUNT(DISTINCT category_id) AS jumlah', false)
            ->where('deleted_at', null)
            ->get()
            ->getRowArray();

        $terpakai = (int) ($baris['jumlah'] ?? 0);

        $totalBuku = $this->db->table('books')
            ->where('deleted_at', null)
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `categories`
WHERE `deleted_at` IS NULL
SELECT COUNT(DISTINCT category_id) AS jumlah
FROM `books`
WHERE `deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `books`
WHERE `deleted_at` IS NULL

    public function dropdown(): array
    {
        $baris = $this->select('id, nama')->orderBy('nama', 'ASC')->findAll();
---
SELECT `id`, `nama`
FROM `categories`
WHERE `categories`.`deleted_at` IS NULL
ORDER BY `nama` ASC