app/Models/DashboardModel.php

SELECT COUNT(*) AS `numrows`
FROM `books`
WHERE `deleted_at` IS NULL
---
    public function totalBuku(): int
    {
        return $this->db->table('books')
            ->where('deleted_at', null)
            ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `members`
WHERE `status` = 'aktif'
AND `deleted_at` IS NULL
---
    public function anggotaAktif(): int
    {
        return $this->db->table('members')
            ->where('status', 'aktif')
            ->where('deleted_at', null)
            ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `tanggal_kembali` IS NULL
---
    public function bukuDipinjam(): int
    {
        return $this->db->table('transactions')
            ->where('tanggal_kembali', null)
            ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `tanggal_kembali` IS NULL
AND `tanggal_jatuh_tempo` < '2026-08-14'
---
    public function bukuTerlambat(): int
    {
        return $this->db->table('transactions')
            ->where('tanggal_kembali', null)
            ->where('tanggal_jatuh_tempo <', date('Y-m-d'))
            ->countAllResults();

SELECT DATE_FORMAT(tanggal_pinjam, '%Y-%m') AS bulan, COUNT(id) AS jumlah
FROM `transactions`
WHERE `tanggal_pinjam` >= '2026-03-01'
GROUP BY `bulan`
---
    public function grafikBulanan(int $jumlahBulan = 6): array
    {
        // Batasi input supaya tidak ada permintaan rentang tak masuk akal
        $jumlahBulan = max(1, min(12, $jumlahBulan));

        $namaBulan = [1 => 'Jan', 'Feb', 'Mar', 'Apr', 'Mei', 'Jun',
            'Jul', 'Agu', 'Sep', 'Okt', 'Nov', 'Des'];

        // 1) Kerangka bulan: kunci 'YYYY-MM' => nilai 0
        $kerangka = [];
        $labels   = [];

        for ($i = $jumlahBulan - 1; $i >= 0; $i--) {
            $waktu               = strtotime("-{$i} month", strtotime(date('Y-m-01')));
            $kunci               = date('Y-m', $waktu);
            $kerangka[$kunci]    = 0;
            $labels[]            = $namaBulan[(int) date('n', $waktu)];
        }

        // Tanggal awal rentang = hari pertama bulan paling lama
        $tanggalAwal = array_key_first($kerangka) . '-01';

        $peminjaman   = $kerangka;
        $pengembalian = $kerangka;

        // 2a) Hitung peminjaman per bulan berdasarkan tanggal_pinjam
        $barisPinjam = $this->db->table('transactions')
            ->select("DATE_FORMAT(tanggal_pinjam, '%Y-%m') AS bulan, COUNT(id) AS jumlah")
            ->where('tanggal_pinjam >=', $tanggalAwal)
            ->groupBy('bulan')
            ->get()
            ->getResultArray();

SELECT DATE_FORMAT(tanggal_kembali, '%Y-%m') AS bulan, COUNT(id) AS jumlah
FROM `transactions`
WHERE `tanggal_kembali` >= '2026-03-01'
GROUP BY `bulan`
---
        }

        // 2b) Hitung pengembalian per bulan berdasarkan tanggal_kembali
        $barisKembali = $this->db->table('transactions')
            ->select("DATE_FORMAT(tanggal_kembali, '%Y-%m') AS bulan, COUNT(id) AS jumlah")
            ->where('tanggal_kembali >=', $tanggalAwal)
            ->groupBy('bulan')
            ->get()
            ->getResultArray();

SELECT `t`.`id`, `t`.`kode_transaksi`, `t`.`tanggal_pinjam`, `t`.`tanggal_jatuh_tempo`, `t`.`tanggal_kembali`, `t`.`status`, `b`.`judul`, `m`.`nama` AS `nama_anggota`
FROM `transactions` `t`
JOIN `books` `b` ON `b`.`id` = `t`.`book_id`
JOIN `members` `m` ON `m`.`id` = `t`.`member_id`
ORDER BY `t`.`tanggal_pinjam` DESC, `t`.`id` DESC
 LIMIT 5
---
    public function peminjamanTerbaru(int $limit = 5): array
    {
        return $this->db->table('transactions t')
            ->select('t.id, t.kode_transaksi, t.tanggal_pinjam, t.tanggal_jatuh_tempo,
                      t.tanggal_kembali, t.status, b.judul, m.nama AS nama_anggota')
            ->join('books b', 'b.id = t.book_id')
            ->join('members m', 'm.id = t.member_id')
            ->orderBy('t.tanggal_pinjam', 'DESC')
            ->orderBy('t.id', 'DESC')
            ->limit($limit)
            ->get()
            ->getResultArray();

SELECT `b`.`id`, `b`.`judul`, `b`.`penulis`, `b`.`sampul`, `b`.`rating`, COUNT(t.id) AS jumlah_pinjam
FROM `books` `b`
LEFT JOIN `transactions` `t` ON `t`.`book_id` = `b`.`id`
WHERE `b`.`deleted_at` IS NULL
GROUP BY `b`.`id`
ORDER BY `jumlah_pinjam` DESC, `b`.`rating` DESC
 LIMIT 4
---
    public function bukuTerpopuler(int $limit = 4): array
    {
        return $this->db->table('books b')
            ->select('b.id, b.judul, b.penulis, b.sampul, b.rating, COUNT(t.id) AS jumlah_pinjam')
            ->join('transactions t', 't.book_id = b.id', 'left')
            ->where('b.deleted_at', null)
            ->groupBy('b.id')
            ->orderBy('jumlah_pinjam', 'DESC')
            ->orderBy('b.rating', 'DESC')
            ->limit($limit)
            ->get()
            ->getResultArray();

SELECT `id`, `kode_anggota`, `nama`, `email`, `tanggal_daftar`, `status`
FROM `members`
WHERE `deleted_at` IS NULL
ORDER BY `tanggal_daftar` DESC, `id` DESC
 LIMIT 5
---
    public function anggotaTerbaru(int $limit = 5): array
    {
        return $this->db->table('members')
            ->select('id, kode_anggota, nama, email, tanggal_daftar, status')
            ->where('deleted_at', null)
            ->orderBy('tanggal_daftar', 'DESC')
            ->orderBy('id', 'DESC')
            ->limit($limit)
            ->get()
            ->getResultArray();