app/Models/MemberModel.php

SELECT *
FROM `members`
WHERE `members`.`deleted_at` IS NULL
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `members`
WHERE `members`.`deleted_at` IS NULL
---
    public function search(?string $keyword = null, ?string $status = null, int $perPage = 10): array
    {
        if ($keyword !== null && $keyword !== '') {
            $this->groupStart()
                 ->like('nama', $keyword)
                 ->orLike('kode_anggota', $keyword)
                 ->orLike('email', $keyword)
                 ->orLike('telepon', $keyword)
                 ->groupEnd();
        }

        if ($status !== null && $status !== '') {
            $this->where('status', $status);
        }

        // 'members' = nama grup pager, dipakai lagi saat merender link
        return $this->orderBy('id', 'DESC')->paginate($perPage, 'members');

SELECT `status`, COUNT(id) AS jumlah
FROM `members`
WHERE `deleted_at` IS NULL
GROUP BY `status`
---
    public function ringkasanStatus(): array
    {
        $baris = $this->db->table('members')
            ->select('status, COUNT(id) AS jumlah')
            ->where('deleted_at', null)
            ->groupBy('status')
            ->get()
            ->getResultArray();