app/Models/SettingModel.php

SELECT `key_name`, `value`
FROM `settings`
---
    public function semua(): array
    {
        if ($this->cache === null) {
            $baris       = $this->select('key_name, value')->findAll();