app/Models/TransactionModel.php

    public function ringkasanPengembalian(): array
    {
        $hariIni = date('Y-m-d');

        $antrean = $this->db->table($this->table)
            ->where('tanggal_kembali', null)
            ->countAllResults();

        $terlambat = $this->db->table($this->table)
            ->where('tanggal_kembali', null)
            ->where('tanggal_jatuh_tempo <', $hariIni)
            ->countAllResults();

        $hariIniCount = $this->db->table($this->table)
            ->where('tanggal_kembali', $hariIni)
            ->countAllResults();

        // Total denda yang terkumpul sepanjang bulan berjalan
        $baris = $this->db->table($this->table)
            ->selectSum('denda', 'total')
            ->where('tanggal_kembali >=', date('Y-m-01'))
            ->get()
            ->getRowArray();
---
SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `tanggal_kembali` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `tanggal_kembali` IS NULL
AND `tanggal_jatuh_tempo` < '2026-08-14'
SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `tanggal_kembali` = '2026-08-14'
SELECT SUM(`denda`) AS `total`
FROM `transactions`
WHERE `tanggal_kembali` >= '2026-08-01'

    public function ringkasan(): array
    {
        $hariIni = date('Y-m-d');

        $aktif = $this->db->table($this->table)
            ->where('tanggal_kembali', null)
            ->countAllResults();

        $terlambat = $this->db->table($this->table)
            ->where('tanggal_kembali', null)
            ->where('tanggal_jatuh_tempo <', $hariIni)
            ->countAllResults();

        $hariIniCount = $this->db->table($this->table)
            ->where('tanggal_pinjam', $hariIni)
            ->countAllResults();

        $selesai = $this->db->table($this->table)
            ->where('tanggal_kembali IS NOT NULL')
            ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `tanggal_kembali` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `tanggal_kembali` IS NULL
AND `tanggal_jatuh_tempo` < '2026-08-14'
SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `tanggal_pinjam` = '2026-08-14'
SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `tanggal_kembali` IS NOT NULL