app/Models/UserModel.php

    public function getByUsername(string $username): ?array
    {
        return $this->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
AND `users`.`deleted_at` IS NULL
 LIMIT 1